/*Спроектувати клас «Гроші» для роботи з грошовими сумами, атрибутами якого є два поля: для представлення гривень і копійок. Клас повинен мати конструктор з параметром, яким є рядок виду 
“гривні,копійки”, можливо інші конструктори, метод виведення об'єкта типу «Гроші», можливо інші методи введення/виведення, 
методи для виконання поставлених завдань. Розробити програму, яка створює два об'єкти типу «Гроші» та інкрементує значення більшого 
із них (з використанням перевантаженого оператора «++»). Програма повинна забезпечувати наочне виведення 
усіх вхідних, вихідних та проміжних даних (з використанням перевантаженого стандартного оператора потокового виведення «<<»).*/
#include <iostream>
#include <string>
#include "Header.h"
using namespace std;

int main()
{
    string s;
    cin.ignore();
    cout << "Enter sum 1 (hrn,kop): ";
    cin >> s;
    Money S1 = Money(s);
    cin.ignore();
    cout << "Enter sum 2 (hrn,kop): ";
    cin >> s;
    Money S2 = Money(s);
    cout << "Sums:\n";
    S1.ou_s();
    S2.ou_s();
    bool que = S1 || S2;
    if (que) {
        cout << "Bigger is 1. ";
        ++S1;
        cout << "New sum:\n";
        S1.ou_s();
    }
    else {
        cout << "Bigger is 2. ";
        ++S2;
        cout << "New sum:\n";
        S2.ou_s();
    }
    system("pause");
    return 0;
}
